src/InformationRegisters/pcru_ПорученияГлавамОтделов/pcru_ПорученияГлавамОтделов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>pcru_ПорученияГлавамОтделов</name>
  <resources>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>СрокВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Принято</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Задача</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлючСвязи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.аДокументооборотКорпоративныйДокумент</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтрокиДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/pcru_ПорученияГлавамОтделов/ManagerModule.bsl
Функция ПолучитьМаксимальныйНомерСтроки(Документ) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	pcru_ПорученияГлавамОтделов.НомерСтрокиДокумента КАК НомерСтроки
	|ИЗ
	|	РегистрСведений.pcru_ПорученияГлавамОтделов КАК pcru_ПорученияГлавамОтделов
	|ГДЕ
	|	pcru_ПорученияГлавамОтделов.Документ = &Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки УБЫВ";
	
	Запрос.УстановитьПараметр("Документ",Документ.ссылка );
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ЕСли Выборка.Следующий() Тогда
		Возврат Выборка.НомерСтроки +1;
	Иначе	
		Возврат 1;
	КонецЕсли;
	
	
	
КонецФункции // ПолучитьМаксимальныйНомерСтроки()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОчиститьПоДокументу(Документ) Экспорт
	
	
	НЗ = РегистрыСведений.pcru_ПорученияГлавамОтделов.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Документ.ссылка);
	НЗ.Прочитать();
	НЗ.Очистить();
	Нз.Записать();
	
	
	
	
	
КонецПроцедуры // ОчиститьПоДокументу()


//КурсыВалют = РегистрыСведений.КурсыВалют;
//НаборКурсов = КурсыВалют.СоздатьНаборЗаписей();
//Доллар = Справочники.Валюты.НайтиПоНаименованию("USD");
//НаборКурсов.Отбор.Валюта.Установить(Доллар);
//НаборКурсов.Отбор.Период.Установить(НачалоДня(ТекущаяДата()));
//НаборКурсов.Прочитать();
//Если НаборКурсов.Количество() = 0 Тогда
//    НовыйКурс = НаборКурсов.Добавить();
//    НовыйКурс.Валюта = Доллар;
//    НовыйКурс.Период = ТекущаяДата();
//ИначеЕсли НаборКурсов.Количество() = 1 Тогда
//    НовыйКурс = НаборКурсов[0];
//Иначе
//    Предупреждение(НСтр("ru = 'Курс валюты задается один раз в день.';"
//     + " en = 'Rate is set once a day.'"), 60);
//    Возврат;
//КонецЕсли;
//НовыйКурс.Курс = 31.44;
//НовыйКурс.Кратность = 1;
//НаборКурсов.Записать();
//Сообщить(НСтр(ru = 'Курс '; en = 'Rate ') 
//    + СокрЛП(НовыйКурс.Валюта) 
//    + НСтр(ru = ' на сегодня: "+"; en = ' for today: ') 
//    + НовыйКурс.Курс + НСтр(ru = ' руб.'; en = ' roub.'"));
